testhound/alo/alo/octave/m480/M480RtlPrintVisitor.cpp
    // Don't print dst, which is a label that is only used as a hint to 
    // the compiler.
  }
    
  void
  M480RtlPrintVisitor::visit(const M480JtableRelativebrInstruction &i)
  {
    getOutputStream() << "br ";

    i.getSrc1()->accept(*this); 

    // Don't print dst, which is a label that is only used as a hint to 
    // the compiler.
  }

  void
  M480RtlPrintVisitor::visit(const M480JbrInstruction &i)
  {
    getOutputStream() << "br ";

    i.getSrc1()->accept(*this); 
    getOutputStream() << " ";

    i.getDst()->accept(*this);

    printNops(i.getNumDelaySlots());
  }
  

  void
  M480RtlPrintVisitor::visit(const M480BcdiInstruction &i)
  {
    printCondBranchImmed(i,"bcdi");
  }

  void
  M480RtlPrintVisitor::visit(const M480BciInstruction &i)
  {
    printCondBranchImmed(i,"bci");
  }
    
  void
  M480RtlPrintVisitor::visit(const M480JbciInstruction &i)
  {
    printCondBranchImmed(i,"bci");
    printNops(i.getNumDelaySlots());
  }
  
  void
  M480RtlPrintVisitor::visit(const M480JbcdiInstruction &i)
  {
    printCondBranchImmed(i,"bcdi");
    printNops(i.getNumDelaySlots());
  }
  

  void
  M480RtlPrintVisitor::visit(const M480BnzrInstruction &i)
  {
    printZeroBranch(i,"bnzr");
  }

  void
  M480RtlPrintVisitor::visit(const M480JbnzrInstruction &i)
  {
    printZeroBranch(i,"bnzr");
    printNops(i.getNumDelaySlots());
  }

  void
  M480RtlPrintVisitor::visit(const M480BzrInstruction &i)
  {
    printZeroBranch(i,"bzr");
  }
  
  void
  M480RtlPrintVisitor::visit(const M480JbzrInstruction &i)
  {
    printZeroBranch(i,"bzr");
    printNops(i.getNumDelaySlots());
  }
  

  void
  M480RtlPrintVisitor::visit(const M480BnziInstruction &i)
  {
    printZeroBranchImmed(i,"bnzi");
  }


  void
  M480RtlPrintVisitor::visit(const M480JbnziInstruction &i)
  {
    printZeroBranchImmed(i,"bnzi");

    printNops(i.getNumDelaySlots());
  }


  void
  M480RtlPrintVisitor::visit(const M480BziInstruction &i)
  {
    printZeroBranchImmed(i,"bzi");
  }

  void
  M480RtlPrintVisitor::visit(const M480JbziInstruction &i)
  {
    printZeroBranchImmed(i,"bzi");

    printNops(i.getNumDelaySlots());
  }

  
  void
  M480RtlPrintVisitor::visit(const M480TsetbInstruction &i)
  {
    printTestBitBranch(i,"tsetb");
  }

  
  void
  M480RtlPrintVisitor::visit(const M480JtsetbInstruction &i)
  {
    printTestBitBranch(i,"tsetb");

    printNops(i.getNumDelaySlots());
  }


  void
  M480RtlPrintVisitor::visit(const M480TclrbInstruction &i)
  {
    printTestBitBranch(i,"tclrb");
  }
  
  void
  M480RtlPrintVisitor::visit(const M480JtclrbInstruction &i)
  {
    printTestBitBranch(i,"tclrb");

    printNops(i.getNumDelaySlots());
  }
  

  void
  M480RtlPrintVisitor::visit(const M480RnmiInstruction &i)
  {
    printReturn(i,"rnmi");
  }

  void
  M480RtlPrintVisitor::visit(const M480JrnmiInstruction &i)
  {
    printReturn(i,"rnmi");

    printNops(i.getNumDelaySlots());
  }


  void
  M480RtlPrintVisitor::visit(const M480RintInstruction &i)
  {
    printReturn(i,"rint");
  }


  void
  M480RtlPrintVisitor::visit(const M480JrintInstruction &i)
  {
    printReturn(i,"rint");

    printNops(i.getNumDelaySlots());
  }

  void
  M480RtlPrintVisitor::visit(const M480BrsInstruction &i)
  {
    getOutputStream() << "brs ";
    i.getDst()->accept(*this);
  }


  void
  M480RtlPrintVisitor::visit(const M480JbrsInstruction &i)
  {
    getOutputStream() << "brs ";
    i.getDst()->accept(*this);

    printNops(i.getNumDelaySlots());
  }


  void
  M480RtlPrintVisitor::visit(const M480BrslInstruction &i)
  {
    getOutputStream() << "brsl ";
    i.getBrslFlags()->accept(*this);
  }


  void
  M480RtlPrintVisitor::visit(const M480JbrslInstruction &i)
  {
    getOutputStream() << "brsl ";
    i.getBrslFlags()->accept(*this);

    printNops(i.getNumDelaySlots());
  }


  void
  M480RtlPrintVisitor::visit(const M480BrspreInstruction &i)
  {
    getOutputStream() << "brspre";
  }
  
  void
  M480RtlPrintVisitor::visit(const M480CmpInstruction &i)
  {
    printCompareBranch(i,"cmp");
  }

  void
  M480RtlPrintVisitor::visit(const M480JcmpInstruction &i)
  {
    getOutputStream() << "cmp" << " ";
    i.getSrc1()->accept(*this);
    getOutputStream() << " ";
    i.getSrc2()->accept(*this);

    if (!i.getBranchTarget()->isNullOperand())
      getOutputStream() << " br = ";

    i.getBranchTarget()->accept(*this);

    getOutputStream() << " ";
    i.getAbcFlag()->accept(*this);

    printNops(i.getNumDelaySlots());
  }

  void
  M480RtlPrintVisitor::visit(const M480CmpiInstruction &i)
  {
    printCompareBranch(i,"cmpi");
  }

  void
  M480RtlPrintVisitor::visit(const M480JcmpiInstruction &i)
  {
    getOutputStream() << "cmpi" << " ";
    i.getSrc1()->accept(*this);
    getOutputStream() << " ";
    i.getSrc2()->accept(*this);

    if (!i.getBranchTarget()->isNullOperand())
      getOutputStream() << " br = ";

    i.getBranchTarget()->accept(*this);

    getOutputStream() << " ";
    i.getAbcFlag()->accept(*this);

    printNops(i.getNumDelaySlots());
  }
  
  void
  M480RtlPrintVisitor::visit(const M480CmprInstruction &i)
  {
    printCompareSign(i,"cmpr");
  }

  void
  M480RtlPrintVisitor::visit(const M480CmpriInstruction &i)
  {
    printCompareSign(i,"cmpri");
  }

  void
  M480RtlPrintVisitor::visit(const M480DepbInstruction &i)
  {
    getOutputStream() << "depb ";

    i.getSrc1()->accept(*this);
    getOutputStream() << " ";

    i.getSrcBitNum()->accept(*this);
    getOutputStream() << " ";

    i.getDst()->accept(*this);
    getOutputStream() << " ";

    i.getDstBitNum()->accept(*this);
    getOutputStream() << " ";

    i.getNumBits()->accept(*this);
    getOutputStream() << " ";

    i.getDepbFlag()->accept(*this);
  }

  void
  M480RtlPrintVisitor::visit(const M480DepbiInstruction &i)
  {
    getOutputStream() << "depbi ";

    i.getSrc1()->accept(*this);
    getOutputStream() << " ";

    i.getDst()->accept(*this);
    getOutputStream() << " ";

    i.getDstBitNum()->accept(*this);
    getOutputStream() << " ";

